In [2]:
import pandas as pd
data=pd.read_csv('data.csv')
diamond=pd.read_csv('diamond.csv')
housing=pd.read_csv('housing.csv')
ToyotaCorolla=pd.read_csv('ToyotaCorolla.csv')

In [3]:
data.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [9]:
data.loc[(data['YearsExperience']>5) & (data['Salary']>60000)].count()[0]

14

In [10]:
data.loc[(data['Salary']>=50000) & (data['Salary']<=80000)].count()[0]

12

In [47]:
import sklearn
from sklearn.model_selection import train_test_split
X = data.iloc[:,0:1].values
y = data.iloc[:,-1].values
X_train,X_test, y_train, y_test = train_test_split(X, y, test_size=0.4, random_state=0)

In [48]:
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score
lr = LinearRegression()
lr.fit(X_train,y_train)
y_pred = lr.predict(X_test)
print(r2_score(y_test,y_pred))

0.9679117063698979

In [67]:
import sklearn
from sklearn.model_selection import train_test_split
X = data['YearsExperience'].values
y = data['Salary'].values


X_train,X_test, y_train, y_test = train_test_split(X, y, test_size=0.4, random_state=0)
X_train = X_train.reshape(-1,1)
X_test = X_test.reshape(-1,1)

from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score
lr = LinearRegression()
lr.fit(X_train,y_train)
y_pred = lr.predict(X_test)
print(r2_score(y_test,y_pred))

0.9679117063698979

In [68]:
housing.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [71]:
housing['floors'].value_counts()

1.0    10680
2.0     8241
1.5     1910
3.0      613
2.5      161
3.5        8
Name: floors, dtype: int64

In [81]:
housing['year'] = housing['date'].apply(lambda x: x[0:4])
housing['year'] = housing['year'].astype('int')

In [83]:
housing.loc[housing['year']<1960]

Empty DataFrame
Columns: [id, date, price, bedrooms, bathrooms, sqft_living, sqft_lot, floors, waterfront, view, condition, grade, sqft_above, sqft_basement, yr_built, yr_renovated, zipcode, lat, long, sqft_living15, sqft_lot15, year]
Index: []

[0 rows x 22 columns]

In [95]:
test = housing.loc[housing['bathrooms']>4]
max_price = test['price'].max()
max_price

7700000

In [97]:
diamond.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53940 entries, 0 to 53939
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  53940 non-null  int64
 1   carat       53940 non-null  float64
 2   cut         53940 non-null  object
 3   color       53940 non-null  object
 4   clarity     53940 non-null  object
 5   depth       53940 non-null  float64
 6   table       53940 non-null  float64
 7   price       53940 non-null  int64
 8   x           53940 non-null  float64
 9   y           53940 non-null  float64
 10  z           53940 non-null  float64
dtypes: float64(6), int64(2), object(3)
memory usage: 4.5+ MB

In [98]:
diamond['clarity'].nunique()

8

In [100]:
diamond['cut'].value_counts()

Ideal        21551
Premium      13791
Very Good    12082
Good          4906
Fair          1610
Name: cut, dtype: int64

In [103]:
diamond.groupby('color').sum()['price']

color
D    21476439
E    30142944
F    35542866
G    45158240
H    37257301
I    27608146
J    14949281
Name: price, dtype: int64

In [105]:
diamond.loc[(diamond['x']==0) & (diamond['y']==0) & (diamond['z']==0)].count()[0]

7

In [107]:
ToyotaCorolla['FuelType'].value_counts()

Petrol    1177
Diesel     144
CNG         15
Name: FuelType, dtype: int64

In [108]:
ToyotaCorolla.head()

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,3,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170

In [112]:
ToyotaCorolla.groupby('Doors').mean()['CC']

Doors
2    1650.000000
3    1538.117363
4    1586.956522
5    1588.955490
Name: CC, dtype: float64

In [113]:
name,age = "Suresh",29 
print(name,age,"is a \"natural\" swimmer")

Suresh 29 is a "natural" swimmer

In [115]:
a,b,c = 10,20,50 
result = (a + b)//c
print("The result is {}".format(c))

The result is 50

In [116]:
a = [1,2,3,4,5]

b = [2,3,4,5,6]

print(a[-1],"and",b[len(b)-1])

5 and 6

In [117]:
a = list(range(0,10,2))

print(a[::-1])

[8, 6, 4, 2, 0]

In [120]:
A = 10

B = 20

if A > 5 & B > 15:

    print("One")

elif A < 5 & B < 15:

    print("Two")

else:

    print("None")

None

In [121]:
A = 2

B = 10

if A > 0 and B%A==0:

    print("One", end=",")

elif B > 5 and B%2 == 1:

    print("Two", end=" ")

else:

    pass

One,

In [125]:
def func(self):

    if self%2==0:

        return None

func(10)

In [126]:
def func(*self):

    for i in self:

        if i in list(range(0,100,10)):

            print("True", end=",")

        else:

            print("False")

func(10,15)

True,False